## Pandas DataFrames I - Working with Columns

In [2]:
import pandas as pd
data = [['Dan', 30, 40000], ['John', 40, 50000],
       ['Helen', 35, 60000], ['Marry', 29, 58000]]
df = pd.DataFrame(data=data, columns=['Name', 'Age', 'Salary'])

In [3]:
df

    Name  Age  Salary
0    Dan   30   40000
1   John   40   50000
2  Helen   35   60000
3  Marry   29   58000

### df.loc[]

In [4]:
df.loc[0]

Name        Dan
Age          30
Salary    40000
Name: 0, dtype: object

In [5]:
df.loc[1, 'Name']

'John'

In [6]:
type(df.loc[0])

pandas.core.series.Series

In [7]:
df.loc[[0, 1, 3]]

    Name  Age  Salary
0    Dan   30   40000
1   John   40   50000
3  Marry   29   58000

In [8]:
df.loc[0:2]

    Name  Age  Salary
0    Dan   30   40000
1   John   40   50000
2  Helen   35   60000

In [9]:
df.loc[[1,2], ['Name', 'Salary']]

    Name  Salary
1   John   50000
2  Helen   60000

In [10]:
df.loc[0:2, ['Name', 'Salary']]

    Name  Salary
0    Dan   40000
1   John   50000
2  Helen   60000

In [11]:
df.loc[:, ['Age', 'Salary']]

   Age  Salary
0   30   40000
1   40   50000
2   35   60000
3   29   58000

### df.iloc[]

In [12]:
df.iloc[0]

Name        Dan
Age          30
Salary    40000
Name: 0, dtype: object

In [15]:
df.iloc[0, 1]

30

In [16]:
df.iloc[0:3]

    Name  Age  Salary
0    Dan   30   40000
1   John   40   50000
2  Helen   35   60000

In [17]:
df.iloc[[1,3],0:2]

    Name  Age
1   John   40
3  Marry   29

In [18]:
df.sample(n=2)  # random 2 rows

    Name  Age  Salary
3  Marry   29   58000
1   John   40   50000

In [25]:
df.sample(frac=0.5)

    Name  Age  Salary
1   John   40   50000
2  Helen   35   60000

In [17]:
dict(zip(df['Name'], df['Age']))  # creating a python dictionary

{'Dan': 30, 'John': 40, 'Helen': 35, 'Marry': 29}

In [13]:
df

    Name  Age  Salary
0    Dan   30   40000
1   John   40   50000
2  Helen   35   60000
3  Marry   29   58000

In [14]:
df.iloc[0]  # row at index 0

Name        Dan
Age          30
Salary    40000
Name: 0, dtype: object

In [16]:
df.iloc[0, 0]  # row at 0, column at index 0

'Dan'